xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
/*
 *   Copyright (C) 2015-2016 Texas Instruments Incorporated
 *
 *   All rights reserved. Property of Texas Instruments Incorporated.
 *   Restricted rights to use, duplicate or disclose this code are
 *   granted through contract.
 *
 *   The program may not be used without the written permission of
 *   Texas Instruments Incorporated or against the terms and conditions
 *   stipulated in the agreement under which this program has been supplied,
 *   and under no circumstances can it be used with non-TI connectivity device.
 *
 ******************************************************************************/

/*
 *  Copyright (c) 2003-2018, LogMeIn, Inc. All rights reserved.
 *
 *  This is part of the Xively C Client library,
 *  it is licensed under the BSD 3-Clause license.
 *
 ******************************************************************************/

/* Example/Board Header files */
#include "xively_example.h"

#include <ti/drivers/net/wifi/simplelink.h>
#include <ti/drivers/SPI.h>
#include <ti/drivers/I2C.h>

#include <stdio.h>
#include <board.h>
#include <pin.h>
#include <gpio.h>
#include <sched.h>

/* driverlib Header files */
#include <ti/devices/cc32xx/inc/hw_types.h>
#include <ti/devices/cc32xx/inc/hw_memmap.h>
#include <ti/devices/cc32xx/driverlib/rom.h>
#include <ti/devices/cc32xx/driverlib/rom_map.h>
#include <ti/devices/cc32xx/driverlib/prcm.h>

#include <ti/sysbios/BIOS.h>
#include <ti/sysbios/knl/Clock.h>

#include <mqueue.h>
#include <simplelinkWifi/provisioning_task.h>

#include "xively.h"
#include "xi_bsp_rng.h"
#include "xi_bsp_time.h"
#include "config_file.h"

#ifdef DEBUG_WOLFSSL
extern void wolfSSL_Debugging_ON();
#endif /* DEBUG_WOLFSSL */

/****************************************************************************
                      LOCAL FUNCTION PROTOTYPES
                       (In order of appearance)
****************************************************************************/
static void InitializeAppVariables();
static void UpdateLEDProgressIndicators( UArg arg0 );
static int8_t validateWifiConfigurationVariables( const char* wifi_ssid,
                                                  const char* wifi_password,
                                                  const char* wifi_security_type );
static void ConnectToXively();
static xi_state_t subscribe_to_topic( xi_context_handle_t context_handle,
                                      const char* channel,
                                      xi_user_subscription_callback_t* callback,
                                      void* user_data );

static void parseCredentialsFromConfigFile();
static int8_t parseKeyValue( config_entry_t* config_file_context,
                             const char* key,
                             const uint8_t is_required,
                             char** out_value );

static int8_t validateWifiConfigurationVariables( const char* wifi_ssid,
                                                  const char* wifi_password,
                                                  const char* wifi_security_type );

static int8_t
validateXivelyCredentialBufferRequirement( const char* config_key, const char* value );

static int8_t mapWifiSecurityTypeStringToInt( const char* security_type );

/****************************************************************************
               Xively Application State Machine Callbacks
****************************************************************************/

/* Invoked when a xi_connect status change occurs. */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state );

/* device topic subscription callbacks used for LED control over the Xively service. */
void on_led_topic( xi_context_handle_t in_context_handle,
                   xi_sub_call_type_t call_type,
                   const xi_sub_call_params_t* const params,
                   xi_state_t state,
                   void* user_data );

/* interrupt handler register to be called whenever a user bushes either of the buttons on
 * the
 * sides of the CC3220 device.
 */
void button_interrupt_handler( unsigned int index );

/* periodically called by the Xively event system to publish temperature sensor data
 * to a Xively topic.
 */
void send_temperature( const xi_context_handle_t context_handle,
                       const xi_timed_task_handle_t timed_task_handle,
                       void* user_data );

static signed char hexConvertASCIINibble( signed char nibble );
static signed char
hexConvertByteASCII( signed char msb, signed char lsb, signed char* val );
static signed char FixWEPKey( char* key, unsigned char keyLen );

/****************************************************************************
                      GLOBAL VARIABLES
****************************************************************************/
pthread_t gProgressIndicatorThread = ( pthread_t )NULL;
pthread_t gProvisioningThread      = ( pthread_t )NULL;
pthread_t gSimpleLinkThread        = ( pthread_t )NULL;
Application_CB gApplicationControlBlock;


/****************************************************************************
         DEFINES FOR DYNAMIC CONFIGURATION OF XIVELY APPLICATION
****************************************************************************/

/* String template for dynamically constructing the various Xively topics
 * that are used for this application. */
#define XIVELY_TOPIC_LEN ( 128 )
#define XIVELY_TOPIC_FORMAT "xi/blue/v1/%s/d/%s/%s"

/* Names of the channels used by this application.  Channels
 * are suffixes to the full topic names. */
#define XIVELY_TEMPERATURE_CHANNEL_NAME "Temperature"
#define XIVELY_GREEN_LED_CHANNEL_NAME "Green LED"
#define XIVELY_ORANGE_LED_CHANNEL_NAME "Orange LED"
#define XIVELY_RED_LED_CHANNEL_NAME "Red LED"
#define XIVELY_BUTTON0_CHANNEL_NAME "Button SW2"
#define XIVELY_BUTTON1_CHANNEL_NAME "Button SW3"

/* Some defaults for the optional connection address configuration values */
#define XIVELY_DEFAULT_BROKER "broker.xively.com"
#define XIVELY_DEFAULT_PORT ( 8883 )

