xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
            /* Green LED topic subscription */
            subscribe_to_topic( in_context_handle, XIVELY_GREEN_LED_CHANNEL_NAME,
                                on_led_topic, ( void* )&gGreenLed );

            /* Orange LED topic subscription */
            subscribe_to_topic( in_context_handle, XIVELY_ORANGE_LED_CHANNEL_NAME,
                                on_led_topic, ( void* )&gOrangeLed );

            /* Red LED topic subscription */
            subscribe_to_topic( in_context_handle, XIVELY_RED_LED_CHANNEL_NAME,
                                on_led_topic, ( void* )&gRedLed );

            return;

        case XI_CONNECTION_STATE_CLOSED:
            Report( "connection closed - reason %d!\n\r", state );

            /* shut down the periodic temperature sensor reading
             * when we lose our connection */
            xi_cancel_timed_task( gTemperatureTaskHandle );
            gTemperatureTaskHandle = XI_INVALID_TIMED_TASK_HANDLE;

            return;
        default:
            Report( "invalid parameter %d\n\r", conn_data->connection_state );
            return;
    }
}

/* @brief Subscribes to a topic given a channel (topic suffix) and a callback.
 * See xively.h for full signature information of callbacks.
 *
 * @param in_context_handle the Xively connection context as was returned from
 * xi_create_context, and passed in from the connection callback on_connected().
 * This value must be used in all further Xively operations, including subscription
 * requests (below.)
 * @param channel a string to append to the end of the topic base string.  General
 * topic structure is:  xi/blue/v1/{accountId}/d/{deviceId}/{channel}.
 * @param callback a pointer to the callback function that handles subscription
 * status updates and incoming messages on the topic.  For this example application
 * this is on_led_topic as specified in the invocation of this function in
 * on_connected() (above.)
 * @param user_data an abstract data pointer that can be anything, and will be
 * passed to the subscription handler on all invocations.  In this case the GPIO
 * index of the corresponding LED is provided. We use this to easily associate a topic
 * with an LED, without having to parse the full topic name.
 * @retval xi_state_t which is the success / failure code of the xi_subscription request.
 * Since the actual subscription response from the service occurs asynchronously, this
 * value represents if the subscription request was properly queued by the Xively Client,
 * and does not reflect the SUBACK value of the subscription request itself.
 */
xi_state_t subscribe_to_topic( xi_context_handle_t context_handle,
                               const char* channel,
                               xi_user_subscription_callback_t* callback,
                               void* user_data )
{
    char topic_name[XIVELY_TOPIC_LEN];
    memset( topic_name, '\0', XIVELY_TOPIC_LEN );

    snprintf( topic_name, XIVELY_TOPIC_LEN, XIVELY_TOPIC_FORMAT,
              gApplicationControlBlock.xivelyAccountId,
              gApplicationControlBlock.xivelyDeviceId, channel );

    return xi_subscribe( context_handle, topic_name, XI_MQTT_QOS_AT_MOST_ONCE, callback,
                         user_data );
}


/**
 * @brief Handles messages sent to the device on the LEDs' topics,
 * including toggle commands and subscription changes.
 *
 * @note For more details please refer to the xively.h - xi_subscribe function.
 *
 * @param in_context_handle - xively context required for calling API functions
 * @param call_type - describes if this callback was invoked for SUBACK or an
 * incoming message
 * @oaram params - structure with data depending on SUBACK or incoming message
 * @param state - state of the operation.  Please see xi_subscribe in xively.h
 * for more information
 * @oaram user_data - Pointer provided upon topic subscription in the connection handler
 * function on_connected(). For this application's use, these are the LED GPIO
 * identifiers so we can directly manipulate the LEDs from this function.
 */
void on_led_topic( xi_context_handle_t in_context_handle,
                   xi_sub_call_type_t call_type,
                   const xi_sub_call_params_t* const params,
                   xi_state_t state,
                   void* user_data )
{
    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                Report( "topic:%s. Subscription failed.\n\r", params->suback.topic );
            }
            else
            {
                Report( "topic:%s. Subscription granted %d.\n\r", params->suback.topic,
                        ( int )params->suback.suback_status );

                /* Switch all off and prepare for incoming led topic messages to control
                 * the LEDs */
                gApplicationControlBlock.initializationState =
                    InitializationState_Complete;
                GPIO_write( Board_LED2, Board_LED_OFF );
                GPIO_write( Board_LED1, Board_LED_OFF );
                GPIO_write( Board_LED0, Board_LED_OFF );
            }
            return;
        case XI_SUB_CALL_MESSAGE:
            if ( params->message.temporary_payload_data_length == 1 )
            {
                if ( InitializationState_Complete ==
                     gApplicationControlBlock.initializationState )
                {
                    uint32_t led_gpio_index = *( ( uint32_t* )user_data );
                    switch ( params->message.temporary_payload_data[0] )
                    {
                        case '0':
#ifndef RELEASE_2
                            GPIO_write( led_gpio_index, Board_LED_OFF );
#else
                            GPIO_write( led_gpio_index, Board_LED_ON );
#endif
                            break;
                        case '1':
#ifndef RELEASE_2
                            GPIO_write( led_gpio_index, Board_LED_ON );
#else
                            GPIO_write( led_gpio_index, Board_LED_OFF );
#endif
                            break;
                        default:
                            Report( "unexpected value on topic %s \n\r",
                                    params->message.topic );
                            break;
                    }
                }
            }
            else
            {
                Report( "unexpected data length on topic %s \n\r",
                        params->message.topic );
            }
            return;
        default:
            return;
    }
}

/**
 * @brief Device's Button Handler. Upon invocation from register interrupt handler,
 * this functions publishes to a specific topic depending on the button pressed.
 * The function also tracks state, toggling it's value between 0 and 1
 * on every corresponding button press.
 *
 * @param index of the interrupt.  This will be either Board_BUTTON0,
 * or Board_BUTTON1
 */
void button_interrupt_handler( unsigned int index )
{
    const char* buttonChannelName = NULL;
    int pinValue                  = 0;
    switch ( index )
    {
        case Board_BUTTON0: /* 0 */
            // Software Button 0 is hardware SW2
            Report( "Board Button 0 pressed\n\r" );
            gApplicationControlBlock.button0State =
                !gApplicationControlBlock.button0State;
            pinValue = gApplicationControlBlock.button0State;
            GPIO_clearInt( Board_BUTTON0 );
            buttonChannelName = XIVELY_BUTTON0_CHANNEL_NAME;
            break;
        case Board_BUTTON1: /* 1 */
            // Software Button 1 is hardware SW3
            Report( "Board Button 1 pressed\n\r" );
            gApplicationControlBlock.button1State =
                !gApplicationControlBlock.button1State;
            pinValue = gApplicationControlBlock.button1State;
            GPIO_clearInt( Board_BUTTON1 );
            buttonChannelName = XIVELY_BUTTON1_CHANNEL_NAME;
            break;
        default:
            Report( "Unknown GPIO device invoked button_interrupt_handler\n\r" );
            break;
    }

    const char* messageValue = NULL;
    switch ( pinValue )
    {
        case 0:
            messageValue = "0";
            break;
        case 1:
            messageValue = "1";
            break;
        default:
            Report( "Unsupported PinValue: %d\n\r", pinValue );
            break;
    }

    /* some last sanity checks, including a check to ensure that we're actively connected
     * to Xively.
     */
    if ( XI_CONNECTION_STATE_OPENED == gApplicationControlBlock.xivelyConnectionStatus &&
         NULL != buttonChannelName && NULL != messageValue )
    {
        char topic_name[XIVELY_TOPIC_LEN];
        memset( topic_name, '\0', XIVELY_TOPIC_LEN );

        snprintf( topic_name, XIVELY_TOPIC_LEN, XIVELY_TOPIC_FORMAT,
                  gApplicationControlBlock.xivelyAccountId,
                  gApplicationControlBlock.xivelyDeviceId, buttonChannelName );

