xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
        Report( "Button press publishing to topic name: %s\n\r", topic_name );
        Report( "message value: %s\n\r", messageValue );
        xi_publish( gXivelyContextHandle, topic_name, messageValue,
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }
}

/**
 * @brief Invoked by the Xively Scheduler as setup as a period task to publish
 * temperature data from the device.  This task was created in on_connected()
 *
 * NOTE: The CC3220 I2C pins, which are required to access the temperature
 * sensor, are shared with the GPIO pins for the LED controls.
 * Therefore this function will momentarily disable the LED controls, read
 * the temperature value, and then put the GPIO controls back in place.
 *
 * @param context_handle - xively context required for calling API functions
 * @param timed_task_handle - context associated with scheduled event.
 * this can be used to cancel the periodic invocation of the task. Please
 * see xi_cancel_timed_task() in xively.h for more information.
 * @oaram user_data - application specific pointer provided upon timed task creation.
 * This is unused in this example, and is NULL.  Please see xi_schedule_timed_task()
 * in on_connected().
 */
void send_temperature( const xi_context_handle_t context_handle,
                       const xi_timed_task_handle_t timed_task_handle,
                       void* user_data )
{
    uint16_t temperature;
    uint8_t txBuffer[1];
    uint8_t rxBuffer[2];
    I2C_Handle i2c;
    I2C_Params i2cParams;
    I2C_Transaction i2cTransaction;

    /* Create I2C for usage */
    PinTypeI2C( PIN_01, PIN_MODE_1 );
    PinTypeI2C( PIN_02, PIN_MODE_1 );

    I2C_Params_init( &i2cParams );
    i2cParams.bitRate = I2C_400kHz;
    i2c               = I2C_open( Board_I2C_TMP, &i2cParams );
    if ( i2c == NULL )
    {
        Report( "Error Initializing I2C for Temperature Reading\r\n" );
        return;
    }

    /* Point to the T ambient register and read its 2 bytes */
    txBuffer[0]                 = 0x01;
    i2cTransaction.slaveAddress = Board_TMP006_ADDR;
    i2cTransaction.writeBuf     = txBuffer;
    i2cTransaction.writeCount   = 1;
    i2cTransaction.readBuf      = rxBuffer;
    i2cTransaction.readCount    = 2;

    if ( I2C_transfer( i2c, &i2cTransaction ) )
    {
        /* Extract degrees C from the received data; see TMP102 datasheet */
        temperature = ( rxBuffer[0] << 6 ) | ( rxBuffer[1] >> 2 );

        /*
         * If the MSB is set '1', then we have a 2's complement
         * negative value which needs to be sign extended */
        if ( rxBuffer[0] & 0x80 )
        {
            temperature |= 0xF000;
        }

        /*
             * For simplicity, divide the temperature value by 32 to get rid of
             * the decimal precision; see TI's TMP006 datasheet */
        temperature /= 32;

        /* Convert to F */
        temperature = ( temperature * 9 ) / 5;
        temperature += 32;
    }
    else
    {
        Report( "I2C Bus fault\n\r" );
    }

    /* Close the I2C context */
    I2C_close( i2c );

    /* Return Pins to LED control over GPIO */
    PinTypeGPIO( PIN_01, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT );

    PinTypeGPIO( PIN_02, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT );

    /* Publish the temperature to Xively */
    char msg[16] = {'\0'};
    sprintf( msg, "%d", temperature );

    char topic_name[XIVELY_TOPIC_LEN];
    memset( topic_name, '\0', XIVELY_TOPIC_LEN );

    snprintf( topic_name, XIVELY_TOPIC_LEN, XIVELY_TOPIC_FORMAT,
              gApplicationControlBlock.xivelyAccountId,
              gApplicationControlBlock.xivelyDeviceId, XIVELY_TEMPERATURE_CHANNEL_NAME );

    Report( "Publishing temperature: %s\n\r", msg );
    xi_publish( context_handle, topic_name, msg, XI_MQTT_QOS_AT_MOST_ONCE,
                XI_MQTT_RETAIN_FALSE, NULL, NULL );
}

/* @brief Retrieves Wifi Credential and Xively Credential information from a configuration
 * file stored on the Flash File System of the device.
 *
 * Invokes the configuration file parser in config_file.h / config_file.c for file
 * operations and for parsing the key value pairs.
 *
 * Ensures that all required credentials exist in the file and that they fit into the
 * Application control block buffers.  Additionally the wifi security
 * type is mapped to an existing CC3220 Simple Link Enumeration.
 *
 * If any validation fails then this function logs an error to the console
 * and loops forever, since any configuration error will prevent the application
 * from connecting to wifi and/or the xively service.
 */
void parseCredentialsFromConfigFile()
{
    config_entry_t* config_file_context;
    int len = 0;
    int err = read_config_file( XIVELY_CFG_FILE, &config_file_context );
    if ( SL_ERROR_FS_INVALID_TOKEN_SECURITY_ALERT == err )
    {
        Report( "[SECURITY ALERT] Invalid token for secure config file %s. Error %d\n\r",
                XIVELY_CFG_FILE, err );
    }
    else if ( SL_ERROR_FS_DEVICE_NOT_SECURED == err )
    {
        Report( "[SECURITY ALERT] Reading the secure config file %s can only be done "
                "in a secure device type. Error %d\n\r",
                XIVELY_CFG_FILE, err );
    }
    else if ( err )
    {
        Report( ". Reading %s config file failed. returned %d\n\r", XIVELY_CFG_FILE,
                err );
        if ( SL_ERROR_FS_FILE_NOT_EXISTS == err )
        {
            Report( ". File does not exist on flash file system.\n\r" );
        }
        Report( ". Cannot recover from error.\n\r" );
        Report( ". Looping forever.\n\r" );
        while ( 1 )
            ;
    }

    /* parse wifi credentials from config file */
    static char *wifi_ssid = NULL, *wifi_security_type = NULL, *wifi_password = NULL;
    err |= parseKeyValue( config_file_context, WIFI_SSID_KEY, 1, &wifi_ssid );
    err |=
        parseKeyValue( config_file_context, WIFI_SEC_TYPE_KEY, 1, &wifi_security_type );
    err |= parseKeyValue( config_file_context, WIFI_PASSWORD_KEY, 1, &wifi_password );

