xively/xively-client-c/examples/cc3220sf/xively_demo/xively_example.c
    if ( 0 == strcmp( wifi_password, WIFI_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        retVal = -1;
        Report( ". Default WiFi Password field entry found.\n\r" );
        Report( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
    }

    return retVal;
}

/* @brief helper function. checks to if key's value string will fit into our Application
 * Control Block
 *
 * @param config_key the key string that was used to lookup the value in the config file.
 * This is only used for logging purposes.
 * @param value the value string that will be stored as a Xively Credential.  This
 * function
 * checks to make sure that the value will fit in the Application Control Blocks buffers
 * for Xively Credentials before a copy is made.
 * @retval 0 if the credentials are of a valid size, -1 otherwise.
 * */
int8_t validateXivelyCredentialBufferRequirement( const char* const config_key,
                                                  const char* value )
{
    if ( NULL == value )
    {
        Report( ". Key \"%s\" is missing a value in the configuration file: \"%s\"\n\r",
                config_key, value );
        return -1;
    }

    if ( 0 == strcmp( value, XIVELY_DEFAULT_CONFIG_FIELD_VALUE ) )
    {
        Report( ". \"%s\" value's is still the default value.\n\r", config_key );
        Report( "   Did you forget to edit the configuration file \"%s\"?\n\r",
                XIVELY_CFG_FILE );
        return -1;
    }

    if ( strlen( value ) > XIVELY_CRED_LEN_MAX )
    {
        Report( ". \"%s\" value's string is too long for internal buffer configuration. "
                "value is: \"%s\"\n\r",
                config_key, value );
        Report( ". Max String Length is: %d\n\r", XIVELY_CRED_LEN_MAX );
        return -1;
    }

    return 0;
}

/* @brief Attempts to match the string from the configuration file to an enumeration
 * the platform's SDK wlan.h file.  The most common LAN types are supported
 * out of the box. The more uncommong lans haven't been tested again
 * but in theory could be enabled.
 * @retval one of the SL_WLAN_SEC_TYPE values as defined in wlan.h, or
 * -1 if the mapping failed.
 */
int8_t mapWifiSecurityTypeStringToInt( const char* security_type )
{
    if ( NULL == security_type )
    {
        Report( "Now Wifi Security Type String found in configuration file!\n\r" );
        return -1;
    }

    if ( strcmp( "open", security_type ) == 0 || strcmp( "OPEN", security_type ) == 0 )
    {
        return SL_WLAN_SEC_TYPE_OPEN;
    }

    if ( strcmp( "wep", security_type ) == 0 || strcmp( "WEP", security_type ) == 0 )
    {
        return SL_WLAN_SEC_TYPE_WEP;
    }

    if ( strcmp( "wpa", security_type ) == 0 || strcmp( "WPA", security_type ) == 0 )
    {
        return SL_WLAN_SEC_TYPE_WPA;
    }

    if ( strcmp( "wpa2", security_type ) == 0 || strcmp( "WPA2", security_type ) == 0 )
    {
        return SL_WLAN_SEC_TYPE_WPA_WPA2;
    }

    if ( strcmp( "wpa_ent", security_type ) == 0 ||
         strcmp( "WPA_ENT", security_type ) == 0 )
    {
        return SL_WLAN_SEC_TYPE_WPA_ENT;
    }

    /* potential future support based on CC3220 SDK:
     *
     * SL_WLAN_SEC_TYPE_WPS_PBC
     * SL_WLAN_SEC_TYPE_WPS_PIN
     * SL_WLAN_SEC_TYPE_P2P_PBC
     * SL_WLAN_SEC_TYPE_P2P_PIN_KEYPAD
     * SL_WLAN_SEC_TYPE_P2P_PIN_DISPLAY
     * SL_WLAN_SEC_TYPE_P2P_PIN_AUTO
     */
    Report( "Unsupported Wifi security type: \"%s\"\n\r", security_type );
    return -1;
}

#if 1
/**
 * @brief Function that is required by WolfSSL library to track the current time.
 */
long XTIME( long* timer )
{
    return xi_bsp_time_getcurrenttime_seconds();
}

/**
 * @brief Function required by the WolfSSL TLS library.
 */
uint32_t xively_ssl_rand_generate()
{
    return xi_bsp_rng_get();
}
#endif

static signed char hexConvertASCIINibble( signed char nibble )
{
    signed char val = -1;

    if ( ( nibble >= '0' ) && ( nibble <= '9' ) )
    {
        val = ( nibble - '0' );
    }
    else if ( ( nibble >= 'A' ) && ( nibble <= 'F' ) )
    {
        val = ( nibble - 'A' + 10 );
    }
    else if ( ( nibble >= 'a' ) && ( nibble <= 'f' ) )
    {
        val = ( nibble - 'a' + 10 );
    }

    return val;
}

static signed char
hexConvertByteASCII( signed char msb, signed char lsb, signed char* val )
{
    signed char msn;
    signed char lsn;

    msn = hexConvertASCIINibble( msb );
    lsn = hexConvertASCIINibble( lsb );

    if ( ( msn < 0 ) || ( lsn < 0 ) )
        return -1;

    *val = ( msn * 16 ) + lsn;

    return 0;
}

static signed char FixWEPKey( char* key, unsigned char keyLen )
{
    int i = 0;
    signed char msb;
    signed char lsb;

    while ( i < ( keyLen >> 1 ) )
    {
        msb = *( key + ( 2 * i ) );
        lsb = *( key + 1 + ( 2 * i ) );

        if ( hexConvertByteASCII( msb, lsb, ( signed char* )( key + i ) ) < 0 )
            return -1;
        i++;
    }

    while ( i < keyLen )
    {
        *( key + i ) = 0;
        i++;
    }

    return 0;
}
